Revit 2027 API
RebarShape.SimpleLine Property
 Check whether this shape consists of a single straight segment, possibly with hooks.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SimpleLine { get; }
Public ReadOnly Property SimpleLine As Boolean
	Get
public:
property bool SimpleLine {
	bool get ();
}
member SimpleLine : bool with get
Property Value
Boolean
See Also
Reference
RebarShape Class
Autodesk.Revit.DB.Structure Namespace